app/controllers/reservations_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def new
    @room = Room.find(params[:room_id])

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def create
    @reservation = Reservation.new(reservation_params)
    @reservation.user_id = current_user.id
    @room = Room.find(params[:reservation][:room_id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def confirm
    @reservation = Reservation.new(reservation_params)
    @room = Room.find(params[:reservation][:room_id])