app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "description", "price", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "宿泊"], ["description", "ちょい安い"], ["price", 5000.0], ["address", "東京"], ["user_id", 2], ["created_at", "2024-04-20 10:11:56.426526"], ["updated_at", "2024-04-20 10:11:56.426526"]]
---
  def create
    @room = current_user.rooms.build(rooms_params)
    if @room.save

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 12]]
---
  def destroy
    set_room
    if @room.destroy