app/controllers/users/registrations_controller.rb

   def create
     @user = User.new(create_users_params)
     if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)